Revit 2024 API
ValueAtPoint Constructor (IList<Double>)
 Creates object from an array of values
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ValueAtPoint(
	IList<double> values
)
Visual Basic
Public Sub New ( _
	values As IList(Of Double) _
)
Visual C++
public:
ValueAtPoint(
	IList<double>^ values
)
Parameters
values
Type: System.Collections.Generic.IList<Double>
 Array of values, each corresponding to "measurement"
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when supplied values contain invalid (infinite or non-number) doubles
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ValueAtPoint Class
ValueAtPoint Overload
Autodesk.Revit.DB.Analysis Namespace